## Final Project 
**Dataset:** The data is scrapped from cars24.com in month of march-2021 .Since 
the data is scrapped from live website ,the data is uncleaned.
Detailed explanation of the site: https://www.cars24.com/faq/
Problem statement: Given the features of the car ,predict the selling price of 
that used car.

**Features:**

Independent variables

* Name:Car Model name along with purchase year of the car.
* Rating:Rating given while car inspection by cars 24 team.
* City: City of that car placed for advertainment ,city is given interms of code format.
* Kilometres:How many kilometres that particular car has driven for before placing that advertisement .
* Year of purchase :Original Date of purchase of that car.
* Owner:How many previous owners it had before selling on cars24 site.
* Fuel type:Type of fuel which car runs on.(Petrol, diesel …) 
* Transmission:whether car is automated or manual transmission.
* RT0: Car registered under which RTO .
* Insurance:expiry date of the insurance if any.
* Insurance_Type: Different types insurance availed by owner.

#### Target:

* Price:Price of the used car.

**Task:** Required r2score is 0.85 on test data. Split data into 80-20 percent.
 Apply the different regression techniques like

1. Linear regression
2. Lasso
3. Ridge
4. Polynomial
5. Decision tree
6. Random forests
7. Xgboost

In [1]:
# Importing required libraries
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)
import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns

In [2]:
# Importing the dataset
data = pd.read_csv('cars_datafinal - Sheet1.csv')
data.head()

,Name,Price,Rating,city,Kilometers,Year_of_Purchase,Owner,Fuel_Type,Transmission,RTO,Insurance,Insurance_Type
0,2010 Maruti Alto LXI,"₹ 174,699",4out of 5,3686,"Kilometers34,854 km",Year of PurchaseMay 2010,OwnerFirst Owner,FuelPetrol,TransmissionMANUAL,RTOAP09,NaN,Insurance TypeInsurance Expired
1,2013 Maruti Wagon R 1.0 VXI,"₹ 333,999",4.2out of 5,3686,"Kilometers39,541 km",Year of PurchaseJuly 2013,OwnerSecond Owner,FuelPetrol,TransmissionMANUAL,RTOAP28,Insurance6/8/2021,Insurance TypeComp
2,2014 Maruti Wagon R 1.0 VXI,"₹ 353,199",4.3out of 5,3686,"Kilometers23,233 km",Year of PurchaseMarch 2014,OwnerSecond Owner,FuelPetrol,TransmissionMANUAL,RTOAP28,Insurance28/4/2021,Insurance TypeComp
3,2013 Hyundai Eon D LITE PLUS,"₹ 237,899",4.4out of 5,3686,"Kilometers27,748 km",Year of PurchaseNovember 2013,OwnerFirst Owner,FuelPetrol,TransmissionMANUAL,RTOAP13,Insurance1/1/2022,Insurance TypeComp
4,2017 Hyundai Eon ERA PLUS,"₹ 300,699",4.4out of 5,3686,"Kilometers12,238 km",Year of PurchaseAugust 2017,OwnerSecond Owner,FuelPetrol,TransmissionMANUAL,RTOTS10,NaN,Insurance TypeExpired

In [3]:
# Get shape of the data
data.shape

(32158, 12)

In [4]:
# To see the columns Name
data.keys()

Index(['Name', 'Price', 'Rating', 'city', 'Kilometers', 'Year_of_Purchase',
       'Owner', 'Fuel_Type', 'Transmission', 'RTO', 'Insurance',
       'Insurance_Type'],
      dtype='object')

In [5]:
# View the short summary
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32158 entries, 0 to 32157
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              32158 non-null  object
 1   Price             32158 non-null  object
 2   Rating            32158 non-null  object
 3   city              32158 non-null  int64
 4   Kilometers        32158 non-null  object
 5   Year_of_Purchase  32158 non-null  object
 6   Owner             32158 non-null  object
 7   Fuel_Type         32158 non-null  object
 8   Transmission      29342 non-null  object
 9   RTO               32158 non-null  object
 10  Insurance         22965 non-null  object
 11  Insurance_Type    32158 non-null  object
dtypes: int64(1), object(11)
memory usage: 2.9+ MB

In [6]:
# Checking the Missing values
data.isna().sum()

Name                   0
Price                  0
Rating                 0
city                   0
Kilometers             0
Year_of_Purchase       0
Owner                  0
Fuel_Type              0
Transmission        2816
RTO                    0
Insurance           9193
Insurance_Type         0
dtype: int64

# Feautres Engineering :-

### Data Cleaning

## Removing Special character in price column

In [7]:
data['Price'] = data['Price'].str.replace(r'\W',"")

<ipython-input-7-0b90577a142f>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  data['Price'] = data['Price'].str.replace(r'\W',"")

## Column Rating

In [8]:
# I want to remove (out of 5) string present in Rating column.
data['Rating'] = data['Rating'].str.replace('out of 5',"")

### In Kilometers features i removed the extra Kilometers and km string or special character

In [9]:
data['Kilometers'] = data['Kilometers'].str.replace('Kilometers',"")

data['Kilometers'] = data['Kilometers'].str.replace('km',"")

data['Kilometers'] = data['Kilometers'].str.replace(r'\W',"")

<ipython-input-9-d680384c4f3d>:5: FutureWarning: The default value of regex will change from True to False in a future version.
  data['Kilometers'] = data['Kilometers'].str.replace(r'\W',"")

## Remove extra Year of Purchase writen by Year_of_Purchase column

In [10]:
data['Year_of_Purchase'] = data['Year_of_Purchase'].str.replace('Year of Purchase',"")

### Year_of_Purchase (Change month year column)

In [11]:
data['Year_of_Purchase'] = pd.to_datetime(data['Year_of_Purchase'])

#data['Year_of_Purchase'] = pd.to_numeric(pd.to_datetime(data['Year_of_Purchase']))

data['year'] = data['Year_of_Purchase'].dt.year
data['month'] = data['Year_of_Purchase'].dt.month
#data['Day'] = data['Year_of_Purchase'].dt.month

#data['Year_of_Purchase'] = data['Year_of_Purchase'].apply(lambda x: x.strftime('%Y-%m'))

### Droping Year_of_Purchase column

In [12]:
data.drop(['Year_of_Purchase'], axis='columns',inplace=True)

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32158 entries, 0 to 32157
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            32158 non-null  object
 1   Price           32158 non-null  object
 2   Rating          32158 non-null  object
 3   city            32158 non-null  int64
 4   Kilometers      32158 non-null  object
 5   Owner           32158 non-null  object
 6   Fuel_Type       32158 non-null  object
 7   Transmission    29342 non-null  object
 8   RTO             32158 non-null  object
 9   Insurance       22965 non-null  object
 10  Insurance_Type  32158 non-null  object
 11  year            32158 non-null  int64
 12  month           32158 non-null  int64
dtypes: int64(3), object(10)
memory usage: 3.2+ MB

## Column Fuel_Type

In [14]:
data['Fuel_Type'] = data['Fuel_Type'].str.replace('Fuel',"")

## Column Transmission

Firstly we need to clean the column (Remove extra Transmission written by our features) or Encoded the column convert into Categorical to Numeric

In [15]:
### Removing the extra Transmission string in our column
data['Transmission'] = data['Transmission'].str.replace('Transmission',"")

### Column Insurance

In [16]:
### Removing the extra Insurance string in our column
data['Insurance'] = data['Insurance'].str.replace('Insurance',"")

### Column Insurance_Type

In [17]:
### Removing the extra Insurance string in our column
data['Insurance_Type'] = data['Insurance_Type'].str.replace('Insurance Type',"")
data['Insurance_Type'] = data['Insurance_Type'].str.replace('Insurance',"")


### For removing space in the string
data['Insurance_Type'] = data['Insurance_Type'].str.replace(" ","")

## Column Owner

In [18]:
data['Owner'] = data['Owner'].str.replace('Owner',"")

## Column RTO

* I am removing the last 2 no's of RTO column

In [19]:
numbers = ["0",'1',"2","3","4","5","6","7","8",
              "9"]
for no in numbers:
    data['RTO'] = data['RTO'].str.replace(no, '')

In [20]:
data.head(2)

,Name,Price,Rating,city,Kilometers,Owner,Fuel_Type,Transmission,RTO,Insurance,Insurance_Type,year,month
0,2010 Maruti Alto LXI,174699,4,3686,34854,First,Petrol,MANUAL,RTOAP,NaN,Expired,2010,5
1,2013 Maruti Wagon R 1.0 VXI,333999,4.2,3686,39541,Second,Petrol,MANUAL,RTOAP,6/8/2021,Comp,2013,7

## column Name

In [21]:
new = data['Name'].str.split(" ", n = 2, expand = True)
new.columns = ['car_year','Company', 'Model']

In [22]:
new.head(1)

  car_year Company     Model
0     2010  Maruti  Alto LXI

In [23]:
new['Company'] = new['Company'].str.lower()
new['Model'] = new['Model'].str.lower()
print(new['Company'].unique())
print(new['Model'].unique())

['maruti' 'hyundai' 'honda' 'chevrolet' 'ford' 'renault' 'volkswagen'
 'tata' 'mahindra' 'toyota' 'datsun' 'mitsubishi' 'nissan' 'kia' 'fiat'
 'skoda' 'opel' 'mg' 'volvo' 'jeep' 'mercedes' 'ssangyong' 'bmw' 'audi'
 'daewoo' 'jaguar' 'landrover' 'force' 'isuzu' 'porsche' 'premier'
 'hindustan' 'icml']
['alto lxi' 'wagon r 1.0 vxi' 'eon d lite plus' ...
 'scorpio vlx at bs iii' 'baleno rs 1.0' 'ciaz s 1.4']

In [24]:
new = new.drop(['car_year'],axis='columns')
new.head(1)

  Company     Model
0  maruti  alto lxi

In [25]:
#new = pd.get_dummies(new['Company'], drop_first=True)
data = pd.concat([data,new], axis='columns')
data = data.drop(['Name'],axis='columns')
pd.set_option('display.max_columns', None)
data.head(2)

,Price,Rating,city,Kilometers,Owner,Fuel_Type,Transmission,RTO,Insurance,Insurance_Type,year,month,Company,Model
0,174699,4,3686,34854,First,Petrol,MANUAL,RTOAP,NaN,Expired,2010,5,maruti,alto lxi
1,333999,4.2,3686,39541,Second,Petrol,MANUAL,RTOAP,6/8/2021,Comp,2013,7,maruti,wagon r 1.0 vxi

In [ ]:
data.to_csv('Cars24new.csv',index=False,)

# ------------------------------Saved csv ---------------------------------------